;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 15 March 2025
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: https://rizonesoft.com
;~ =============================================================================

[Main]
Product = Firemin
Version = 12

[Language]
;~ Please ad the translated language name next to the English name. For example; Ελληνικά - Greek
Name = Polski - Polish
Code = pl
Encoding = Unicode (UTF-16) LE BOM

[Translations]
;~ Please do not translate this section.
About = About
Custom = Custom
Donate = Donate
Menus = Menus
Messages = Messages
Messages2 = Messages2
Preferences = Preferences
Update = Update
Versioning = Versioning

[About]
Window_Title = O programie %{Program.Name}
Label_Version = Wersja
Label_AutoIt = Utworzono przy użyciu AutoIt w wersji
Label_Copyright = Prawa autorskie
Tip_Title_Donate = Wesprzyj naszą działalność
Tip_Message_Donate = Twoja darowizna pomoże nam utrzymać nasze oprogramowanie za darmo\r\ni pozwoli nam pozyskać narzędzia i usługi,\r\nktórych używamy, aby Ci służyć.
Label_Home = Strona główna
Label_License = Licencja
Label_Support = Uzyskaj pomoc
Tip_Title_Country = Wyprodukowano w RPA
Tip_Message_Country = %{Program.Name} powstał w Republice Południowej Afryki.
Label_Contributors = Współtwórcy
Button_Ok = OK
Label_RAM = (RAM) %d MB wolne z %d MB (%d%%)
Label_HDD = (%s) %.2f GB wolne z %.2f GB (%d%%)
Tip_Facebook = Obserwuj nas na Facebooku.
Tip_GitHub = %{Program.Name} na GitHubie.

[Custom]
Label_Status_Welcome = Rozpocznij od wczytania przeglądarki (wybierz plik).\r\n%{Program.Name} automatycznie wykryje proces z wybranego pliku wykonywalnego.
Label_Status_Updates = Sprawdzanie aktualizacji
Group_Load_Browser = Wczytaj przeglądarkę
Label_Executable = Ścieżka pliku wykonywalnego (%s):
Label_Process_Usage = Użycie | Szczyt:
Label_Process_Count = Liczba procesów:
Button_Browse = &Przeglądaj
Group_Options = Opcje
Checkbox_Reduce_Mem = Zmniejszaj pamięć co:
Label_Milliseconds = milisekund
Checkbox_Reduce_Limit = Zmniejszaj pamięć, gdy użycie przekracza:
Checkbox_Start_With = Uruchom %s przy starcie %{Program.Name}
Checkbox_Enable_Extended_Processes = Włącz rozszerzone procesy
Button_Extended_Processes = &Rozszerzone procesy
Checkbox_Start_Windows = Uruchom %{Program.Name} przy starcie Windows
Label_Settings_Updated = Ustawienia zostały pomyślnie zaktualizowane.
Button_Cancel = Anuluj
Button_Save = Zapisz
Time_Unit_01 = milisekund
Time_Unit_02 = sekund
Time_Unit_03 = minut
Time_Unit_04 = godzin
Label_Boost_Description = Zmniejszaj co %s %s, gdy użycie przekracza %s MB.
Title_Select_Browser = Wybierz przeglądarkę
Tip_Minimized_Title = %{Program.Name} nadal działa!
Tip_Minimized_Message = %{Program.Name} będzie nadal optymalizować użycie pamięci %s.\r\nKliknij ikonę w obszarze powiadomień, aby zmodyfikować różne opcje optymalizacji.
Label_Notice = %{Program.Name} jest przeznaczony do użytku na komputerach stacjonarnych i laptopach.\r\nDla środowisk serwerowych stworzyliśmy Firemin Server. Dowiedz się więcej...

[Donate]
Label_Heading = Co powiesz na małą darowiznę, aby nasze oprogramowanie pozostało darmowe na zawsze?
Label_Message = Kliknij przycisk PayPal poniżej, wybierz kwotę i wyślij darowiznę.\r\nTwoja darowizna pomoże ulepszyć nasze oprogramowanie i utrzymać wszystko za darmo na Rizonesoft.\r\nDarowizna w wysokości 20$ pomoże nam działać przez co najmniej miesiąc.
Label_Donate = Czy rozważyłbyś darowiznę w wysokości 10$, aby pomóc nam ulepszyć %{Program.Name} i kontynuować naszą misję?

[Menus]
File = &Plik
File_Preferences = &Preferencje
File_Close = &Zakończ\tShift+Alt+F4
Help = Pomo&c
Help_Update = &Sprawdź aktualizacje
Help_Home = &Strona główna %{Company.Name}
Help_Downloads = &Więcej do pobrania
Help_Support = &Uzyskaj pomoc
Help_Issue = &Zgłoś problem
Help_Donate = &Wesprzyj naszą działalność
Help_About = O programie %{Program.Name}
Tray_About = O programie %{Program.Name} %s
Tray_Open = Otwórz %{Program.Name}
Tray_Extended_Processes = Rozszerzone procesy
Tray_Run = Uruchom %s
Tray_Run_Safemode = Uruchom %s w trybie awaryjnym

[Messages]
Info_Title = Proszę zwrócić uwagę
Warning_Title = Ostrzeżenie!
Error_Title = Ups! Coś poszło nie tak!
Error_Oops = Ups!
Singleton = Inna instancja %{Program.Name} jest już uruchomiona.\r\nWskazówka: Kliknij ikonę %{Program.Name} w obszarze powiadomień.
Compatible = %{Program.Name} nie jest kompatybilny z Twoją wersją Windows.\r\nJeśli uważasz, że to błąd, nie wahaj się zostawić wiadomości na '%s' ze wszystkimi szczegółami.
Compatible_Bit = Niestety, 32-bitowa wersja %{Program.Name} nie jest kompatybilna z Twoją wersją Windows.\r\nProszę pobrać 64-bitową wersję %{Program.Name} z '%s'.

[Preferences]
Window_Title = Preferencje
Tab_General = Ogólne
Tab_Performance = Wydajność
Tab_Language = Język
Group_Notifications = Powiadomienia
Group_Extended_Processes = Rozszerzone procesy
Group_Priority = Priorytet
Group_Memory = Pamięć
Group_Language = Język
Checkbox_Notifications = Pokazuj powiadomienia w obszarze powiadomień
Label_Extended_Processes = Wprowadź tutaj nazwy dodatkowych procesów, które chcesz, aby %{Program.Name} optymalizował.\r\nLista musi być oddzielona przecinkami (Process01.exe, Process02.exe, itp.)
Label_SetPriority = Ustaw priorytet procesu:
Checkbox_SaveRealtime = Zapisz priorytet powyżej wysokiego (niezalecane).
Checkbox_ReduceMemory = Zmniejszaj pamięć w systemach z małą ilością pamięci.
Label_Language_Message = Wybierz preferowany język, a następnie naciśnij przycisk %s, aby kontynuować.\r\n(Wymagane ponowne uruchomienie)
Button_Save = Zapisz
Button_Cancel = Anuluj
Label_Updated = Preferencje zaktualizowane
MsgBox_Language_Title = Język zmieniony
MsgBox_Language_Message = Wybrany język został zmieniony.\r\n%{Program.Name} musi zostać uruchomiony ponownie, aby zastosować wybrany język.
MsgBox_Closing_Title = Zamykanie %{Program.Name}
MsgBox_Closing_Message = Czy chcesz teraz zamknąć %{Program.Name}?

[Update]
Window_Title_Available = Dostępna aktualizacja
Window_Title_Congratulations = Gratulacje!
Window_Title_Error = Coś poszło nie tak!
Label_Message_Update = Dostępna jest nowa wersja '%{Program.Name}'.
Label_Message_Latest = Używasz najnowszej wersji '%{Program.Name}'.
Label_Message_Error = Nie można pobrać informacji o najnowszej wersji '%{Program.Name}'.
Label_Message_Internet = Sprawdź połączenie internetowe i spróbuj ponownie.
Label_Build_Current = Obecna wersja:
Label_Build_Update = Wersja aktualizacji:
CheckBox_NoUpdate = Nie sprawdzaj aktualizacji przy starcie.
Button_Update = Dowiedz się więcej
Button_Close = Zamknij

[Versioning]
Administrator = Administrator
Build = Wersja
AutoIt_Version = Używa AutoIt w wersji %{AutoIt.Version}
Bit = bit